Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/passports/index.html.txt.tmx
Source language: en
Languages: ga

source: Applying for your first Irish passport
ga: Ag déanamh iarratais ar phas Éireannach

source: Application procedures involved in getting your first Irish passport, including for those living outside Ireland
ga: Deanann an cáípéis seo cur síos ar conas iarratas a dhéanamh ar do chéad Phas Éireannach, go háirithe dóibh siúd a bhfuil cónaí orthu taobh amuigh d'Éirinn

source: Renewing an Irish passport
ga: Pas Éireannach a athnuachan

source: Application procedures involved in renewing an Irish passport, including for those living outside Ireland
ga: Gnáthaimh iarratais a bhaineann le pas Éireannach a athnuachan, dóibh siúd atá ina gcónaí taobh amuigh d’Éire san áireamh

source: Replacing a lost or stolen Irish passport
ga: Pas Éireannach caillte nó goidthe a athsholáthar

source: Irish passports are important legal documents
ga: Cáipéisí tábhachtacha dlíthiúla iad pasanna Éireannacha

source: Information and advice on what to do if your Irish passport is lost or stolen in Ireland or abroad
ga: Tá eolas ar fáil anseo céard ba cheart duit a dhéanamh má chailleann tú do phas Éireannach nó má ghoidtear é in Éirinn nó thar lear

source: What documentation is required when applying for an Irish passport for a child depends on a number of factors, including when and where the child was born
ga: Braitheann an cháipéisíocht atá de dhíth nuair a bhítear ag déanamh iarratais ar phas Éireannach ar roinnt fachtóirí, lena n-áirítear uair agus áit bhreithe an linbh

source: You can use the new Irish passport card for travel within the European Union and the European Economic Area
ga: Féadfaidh tú an cárta pas Éireannach nua a úsáid le haghaidh taistil laistigh den Aontas Eorpach agus sa Limistéar Eorpach Eacnamaíoch

source: Most Read in "Travel and Recreation"
ga: Ábhar is mó éilimh i "Taisteal agus Áineas"
